Creating a panda series

In [1]:
import pandas as pd
import numpy as np

In [2]:


# creating pandas series

myindex = ['USA','Canada','Mexico']
mydata=[1776,1867,1821]
myser=pd.Series(data=mydata)
print(myser)

# myser with index
myser=pd.Series(data=mydata,index=myindex)
print(myser)

# series from a dictionary

age={'sam':5,'Frank':10,'Mike':8}
myser=pd.Series(age)
print(myser)

0    1776
1    1867
2    1821
dtype: int64
USA       1776
Canada    1867
Mexico    1821
dtype: int64
sam       5
Frank    10
Mike      8
dtype: int64

Operations between series

In [3]:
q1={'Japan':80,'India':50,'China':40}

q1_sales=pd.Series(q1)

# multiply
print(q1_sales*2)

q2={'Brazil':70,'India':60,'China':45}
q2_sales=pd.Series(q2)

Japan    160
India    100
China     80
dtype: int64

# Adding 2 series
use the fill_value to remove nan, if the field is not present in a series

In [4]:
q1_q2=q1_sales+ q2_sales
print(q1_q2)
q1_sales.add(q2_sales,fill_value=0)

Brazil      NaN
China      85.0
India     110.0
Japan       NaN
dtype: float64

Brazil     70.0
China      85.0
India     110.0
Japan      80.0
dtype: float64

Dataframe
Dataframe is a table of column and rows in pandas, that we can restructure and filter.
It is group of pandas series that share same index.

In [5]:


mydata=np.random.randint(0,101,(4,3))
# print(mydata)

myindex=['CA','NY','AZ','TX']
mycolumns=['Jan','Feb','Mar']

df=pd.DataFrame(data=mydata,index=myindex,columns=mycolumns)
print(df.info())
print(df)

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, CA to TX
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Jan     4 non-null      int32
 1   Feb     4 non-null      int32
 2   Mar     4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes
None
    Jan  Feb  Mar
CA   57   19   85
NY   67    5   73
AZ   79   75   11
TX   11   65   27

Dataframe properties

columns
index
info
describe
describe.transpose
head
tail

In [6]:
# print(str(df.info) + '\n')
# print(df.index )
# print(df.columns )
# print(str(df.head) + '\n')
# print(str(df.tail) + '\n')
# print(str(df.describe)  + '\n')
print(str(df.describe().transpose)  + '\n')

<bound method DataFrame.transpose of              Jan        Feb        Mar
count   4.000000   4.000000   4.000000
mean   53.500000  41.000000  49.000000
std    29.726531  34.215006  35.590261
min    11.000000   5.000000  11.000000
25%    45.500000  15.500000  23.000000
50%    62.000000  42.000000  50.000000
75%    70.000000  67.500000  76.000000
max    79.000000  75.000000  85.000000>

Reading a csv file and creating a dataframe

In [7]:
import os

os.chdir(r"C:\Users\jogym\Documents\Jogy\Study\python\data\Pandas_excel") # here r is used to denote a raw text. Else need //
print(os.getcwd())
df=pd.read_csv('tips.csv')
# print(df.info())

print(df["total_bill"])


print(df['total_bill']/df['tip'])

C:\Users\jogym\Documents\Jogy\Study\python\data\Pandas_excel
0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64
0      16.821782
1       6.228916
2       6.002857
3       7.154079
4       6.811634
         ...
239     4.903716
240    13.590000
241    11.335000
242    10.182857
243     6.260000
Length: 244, dtype: float64

To add a column to the dataframe

In [8]:
df['tip_percentage']=df['total_bill']/	df['tip']
df.describe

<bound method NDFrame.describe of      total_bill   tip     sex smoker   day    time  size  price_per_person  \
0         16.99  1.01  Female     No   Sun  Dinner     2              8.49
1         10.34  1.66    Male     No   Sun  Dinner     3              3.45
2         21.01  3.50    Male     No   Sun  Dinner     3              7.00
3         23.68  3.31    Male     No   Sun  Dinner     2             11.84
4         24.59  3.61  Female     No   Sun  Dinner     4              6.15
..          ...   ...     ...    ...   ...     ...   ...               ...
239       29.03  5.92    Male     No   Sat  Dinner     3              9.68
240       27.18  2.00  Female    Yes   Sat  Dinner     2             13.59
241       22.67  2.00    Male    Yes   Sat  Dinner     2             11.34
242       17.82  1.75    Male     No   Sat  Dinner     2              8.91
243       18.78  3.00  Female     No  Thur  Dinner     2              9.39

             Payer Name         CC Number Payment ID  tip_percentage
0    Christy Cunningham  3560325168603410    Sun2959       16.821782
1        Douglas Tucker  4478071379779230    Sun4608        6.228916
2        Travis Walters  6011812112971322    Sun4458        6.002857
3      Nathaniel Harris  4676137647685994    Sun5260        7.154079
4          Tonya Carter  4832732618637221    Sun2251        6.811634
..                  ...               ...        ...             ...
239       Michael Avila  5296068606052842    Sat2657        4.903716
240      Monica Sanders  3506806155565404    Sat1766       13.590000
241          Keith Wong  6011891618747196    Sat3880       11.335000
242        Dennis Dixon     4375220550950      Sat17       10.182857
243     Michelle Hardin  3511451626698139    Thur672        6.260000

[244 rows x 12 columns]>

to remove column from the dataframe
Axis=0 is to remove rows 
Axis=1 is to remove columns

Do not use drop directly on a dataframe, instead it is preferred to copy it to a new object.

In [9]:
df1 =df.drop(['tip_percentage'],axis=1)
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

Working with rows
To set a column as an index
Remove a column index

In [10]:
# df.info
df2=df1.set_index("Payment ID",inplace=True)

dt=df2.loc[["Sun2959"]]
# df1.reset_index()

AttributeError: 'NoneType' object has no attribute 'loc'

Locate a row
Grab multiple rows
Removing rows

In [ ]:
df1.iloc[0]

In [11]:
df1.iloc[0:4]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994

Remove a row

In [17]:
df1.drop('Sun2959',axis=0)
df1

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...
Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842
Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139

To add a row

In [42]:
add_new=df1.iloc[0]
# df2=df1.combine(add_new)


df2=pd.concat([df1,add_new],axis=1)
print(df2)

                  level_0  index Payment ID  total_bill   tip     sex smoker  \
0                     0.0    0.0    Sun2959       16.99  1.01  Female     No
1                     1.0    1.0    Sun4608       10.34  1.66    Male     No
2                     2.0    2.0    Sun4458       21.01  3.50    Male     No
3                     3.0    3.0    Sun5260       23.68  3.31    Male     No
4                     4.0    4.0    Sun2251       24.59  3.61  Female     No
...                   ...    ...        ...         ...   ...     ...    ...
time                  NaN    NaN        NaN         NaN   NaN     NaN    NaN
size                  NaN    NaN        NaN         NaN   NaN     NaN    NaN
price_per_person      NaN    NaN        NaN         NaN   NaN     NaN    NaN
Payer Name            NaN    NaN        NaN         NaN   NaN     NaN    NaN
CC Number             NaN    NaN        NaN         NaN   NaN     NaN    NaN

                  day    time  size  price_per_person          Payer Name  \
0                 Sun  Dinner   2.0              8.49  Christy Cunningham
1                 Sun  Dinner   3.0              3.45      Douglas Tucker
2                 Sun  Dinner   3.0              7.00      Travis Walters
3                 Sun  Dinner   2.0             11.84    Nathaniel Harris
4                 Sun  Dinner   4.0              6.15        Tonya Carter
...               ...     ...   ...               ...                 ...
time              NaN     NaN   NaN               NaN                 NaN
size              NaN     NaN   NaN               NaN                 NaN
price_per_person  NaN     NaN   NaN               NaN                 NaN
Payer Name        NaN     NaN   NaN               NaN                 NaN
CC Number         NaN     NaN   NaN               NaN                 NaN

                     CC Number                   0
0                 3.560325e+15                 NaN
1                 4.478071e+15                 NaN
2                 6.011812e+15                 NaN
3                 4.676138e+15                 NaN
4                 4.832733e+15                 NaN
...                        ...                 ...
time                       NaN              Dinner
size                       NaN                   2
price_per_person           NaN                8.49
Payer Name                 NaN  Christy Cunningham
CC Number                  NaN    3560325168603410

[257 rows x 14 columns]